src/main/resources/schemas/requests/product_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://quickcomp.com/quickcomp/soap/entities/">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getProductRequest>
            <us:orderId>1</us:orderId>
        </us:getProductRequest>
    </soapenv:Body>
</soapenv:Envelope>